
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;crime-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;hmc-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;snl-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;crime-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;hmc-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;snl-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;crime-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;hmc-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;snl-health&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;elinks-health&#34;]
* Replace
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;elinks-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;vh-health&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["crime-health"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Health check for Crime"
      + display_name        = "Crime Health Check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "crime-health"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/crime-health"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["elinks-health"] will be updated in-place
  ~ resource "azurerm_api_management_api_operation" "apim_api_operation" {
      ~ description         = "Health check for Einks" -> "Health check for eLinks API"
      ~ display_name        = "Einks Health" -> "eLinks API Health Check"
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/elinks-health"
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["hmc-health"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Health check for HMC"
      + display_name        = "HMC Health Check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "hmc-health"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/hmc-health"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["snl-health"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Health check for SNL"
      + display_name        = "SNL Health Check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "snl-health"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/snl-health"

      + request {
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["crime-health"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "crime-health"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["hmc-health"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "hmc-health"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["snl-health"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "snl-health"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["crime-health"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "health-check"
      + id               = (known after apply)
      + name             = "health-check"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["elinks-health"] must be replaced
-/+ resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      ~ display_name     = "eLinks" -> "health-check"
      ~ id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/elinks-health/tags/eLinks" -> (known after apply)
      ~ name             = "eLinks" -> "health-check" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["hmc-health"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "health-check"
      + id               = (known after apply)
      + name             = "health-check"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["publication-health"] must be replaced
-/+ resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      ~ display_name     = "CaTH" -> "health-check"
      ~ id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/publication-health/tags/CaTH" -> (known after apply)
      ~ name             = "CaTH" -> "health-check" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["snl-health"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "health-check"
      + id               = (known after apply)
      + name             = "health-check"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["vh-health"] must be replaced
-/+ resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      ~ display_name     = "video-hearings" -> "health-check"
      ~ id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/vh-health/tags/video-hearings" -> (known after apply)
      ~ name             = "video-hearings" -> "health-check" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 12 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Vars":{}} -->